import numpy as np

COLOR_RANGES = {
    'Вода': {
        'река': {
            'range': np.array([90, 30, 50, 130, 255, 255]),
            'color': (255, 100, 100),  
        },
        'озеро': {
            'range': np.array([95, 40, 50, 125, 255, 255]),
            'color': (255, 150, 50),   
        },
        'океан': {
            'range': np.array([100, 50, 30, 130, 255, 200]),
            'color': (200, 50, 50),    
        },
        'море': {
            'range': np.array([100, 40, 40, 130, 255, 220]),
            'color': (255, 100, 50),   
        },
        'болото': {
            'range': np.array([60, 20, 30, 90, 150, 150]),
            'color': (100, 150, 100),  
        },
        'ручей': {
            'range': np.array([90, 20, 100, 120, 100, 255]),
            'color': (255, 200, 150),  
        },
    },
    'Лес': {
        'луг': {
            'range': np.array([40, 40, 100, 80, 150, 255]),
            'color': (100, 255, 100),  
        },
        'поляна': {
            'range': np.array([40, 30, 120, 85, 120, 255]),
            'color': (50, 255, 50),    
        },
        'роща': {
            'range': np.array([35, 50, 50, 85, 255, 200]),
            'color': (0, 200, 0),      
        },
        'чаща': {
            'range': np.array([30, 60, 30, 90, 255, 150]),
            'color': (0, 150, 0),     
        },
        'тайга': {
            'range': np.array([35, 40, 40, 95, 255, 130]),
            'color': (0, 100, 0),      
        },
    },
    
    'Горы': {
        'скалы': {
            'range': np.array([0, 0, 50, 20, 50, 150]),
            'color': (100, 100, 150),  
        },
        'обрыв': {
            'range': np.array([10, 10, 30, 30, 100, 120]),
            'color': (50, 50, 100),   
        },
        'ущелье': {
            'range': np.array([0, 0, 20, 30, 80, 100]),
            'color': (30, 30, 50),     
        },
        'камни': {
            'range': np.array([0, 0, 60, 40, 60, 180]),
            'color': (120, 120, 180),  
        },
    },
    'Пустыня': {
        'песок': {
            'range': np.array([15, 30, 150, 35, 150, 255]),
            'color': (0, 200, 255),    
        },
        'дюны': {
            'range': np.array([20, 20, 120, 35, 100, 220]),
            'color': (0, 180, 255),   
        },
        'каменистая_пустыня': {
            'range': np.array([20, 10, 80, 40, 100, 180]),
            'color': (0, 100, 200),    
        },
        'сухая_земля': {
            'range': np.array([10, 30, 60, 25, 150, 150]),
            'color': (0, 150, 200),    
        },
    },
    
    'Равнины': {
        'степь': {
            'range': np.array([30, 20, 80, 70, 100, 200]),
            'color': (100, 255, 150),  
        },
        'поле': {
            'range': np.array([40, 30, 100, 80, 100, 220]),
            'color': (150, 255, 100),  
        },
        'саванна': {
            'range': np.array([25, 30, 100, 40, 150, 220]),
            'color': (100, 255, 200),  
        },
        'холмы': {
            'range': np.array([35, 30, 90, 85, 120, 180]),
            'color': (50, 255, 100),   
        },
        'равнина': {
            'range': np.array([40, 20, 110, 80, 80, 230]),
            'color': (200, 255, 150),  
        },
    },
    'Снег': {
        'снег': {
            'range': np.array([0, 0, 200, 180, 50, 255]),
            'color': (255, 255, 255), 
        },
        'лед': {
            'range': np.array([90, 10, 150, 140, 100, 255]),
            'color': (255, 255, 200),  
        },
        'ледник': {
            'range': np.array([100, 5, 180, 150, 50, 255]),
            'color': (255, 250, 180),  
        },
        'заснеженные_холмы': {
            'range': np.array([0, 0, 180, 180, 30, 255]),
            'color': (220, 220, 220),  
        },
        'вечная_мерзлота': {
            'range': np.array([0, 0, 150, 180, 40, 230]),
            'color': (200, 200, 230), 
        },
    }
}